Revit 2027 API
DisplacementElement.IsNotEmpty Method
 Validates that the input set of element ids is valid for a DisplacementElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsNotEmpty(
	ICollection<ElementId> elementIds
)
Public Shared Function IsNotEmpty (
	elementIds As ICollection(Of ElementId)
) As Boolean
public:
static bool IsNotEmpty(
	ICollection<ElementId^>^ elementIds
)
static member IsNotEmpty :
        elementIds : ICollection<ElementId> -> bool
Parameters
elementIds ICollection<ElementId>
 A set of element ids.
Return Value
Boolean
 True if the set of element ids is not empty.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace